# ExternallyTaggedBRep Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedBRep Properties
ExternallyTaggedBRep Class See Also
---
The ExternallyTaggedBRep type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalId | The external Id of the geometry object.  (Inherited from ExternallyTaggedGeometryObject.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ExternallyTaggedGeometryObject.) |

# See Also
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace